package project_05;
/*
--------------------------------------------------------------------------------------------------------------------------------------------------
方法的初步使用————02————有参数类型
--------------------------------------------------------------------------------------------------------------------------------------------------
*/
public class P_02 {
    public static void main(String[] args) {
        int x = 1234;
        int y = 2345;
        int sum = add(x, y);
        System.out.println(sum);        //使用方法后的第一种输出方式
        System.out.println(add(x, y));  //使用方法后的第二种输出方式
    }

    public static int add(int x, int y) {
        int sum = x + y;
        return sum;
    }
}
